In [24]:
import pandas as pd
import numpy as np

In [13]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

#### 연습문제 1
- 붓꽃(iris) 데이터에서 붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width) 등의 평균을 구하라

In [1]:
# 붓꽃(iris) 데이터 로드
import seaborn as sns
iris = sns.load_dataset("iris")

In [3]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
# 붓꽃 종 별로 그룹핑을 진행하시오

In [7]:
# 그룹핑된 위 객체를 이용해 각 품종 별 꽃잎길이의 평균을 구하시오

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64

In [8]:
# 그룹핑된 groups 객체를 이용하여 각 품종별 꽃받침 길이의 평균을 구하시오

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

#### 연습문제 2
- 아래 데이터를 사용하여 문제를 해결하시오

In [9]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

#### 문제 1

- total_bill 대비 팁 요금의 비율을 계산하고 가공필드 tip_pt 열에 저장하시오.

- 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

- 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

In [10]:
# total_bill 대비 팁 요금의 비율을 계산하고 가공필드 tip_pt 열에 저장하시오.

tips.head()
tips.tail()

     total_bill   tip     sex smoker   day    time  size    tip_pt
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [12]:
# 각 요일별 손님의 수를 확인하세요

day
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64

In [28]:
# 각 요일별 한테이블당 인원수의 평균을 확인하세요

day
Thur   2.4516
Fri    2.1053
Sat    2.5172
Sun    2.8421
Name: size, dtype: float64

In [15]:
# 점심/저녁 손님의 수를 비교 하세요

time
Lunch      68
Dinner    176
dtype: int64

In [32]:
# 점심 저녁 별로 테이블당 인원수의 평균을 구하시오.

         size
time
Lunch  2.4118
Dinner 2.6307

In [18]:
# 각 요일별 점심/저녁 손님의 수를 피봇 테이블로 확인하세요

time  Lunch  Dinner
day
Thur     61       1
Fri       7      12
Sat       0      87
Sun       0      76

In [33]:
# 각 요일별 테이블당 인원수의 평균과 최대인원 최소인원을 피봇테이블로 확인하시오

       mean  max  min
       size size size
day
Thur 2.4516    6    1
Fri  2.1053    4    1
Sat  2.5172    5    1
Sun  2.8421    6    2

In [45]:
# 각 요일별 테이블당 인원수의 평균과 최대인원 최소인원을 피봇테이블로 확인하시오

            mean  max  min
            size size size
day  time
Thur Lunch  2.46    6    1
     Dinner 2.00    2    2
Fri  Lunch  2.00    3    1
     Dinner 2.17    4    2
Sat  Dinner 2.52    5    1
Sun  Dinner 2.84    6    2

In [43]:
# 각 요일별 테이블당 인원수의 평균과 최대인원 최소인원을 피봇테이블로 확인하시오
pd.options.display.float_format = '{:.2f}'.format

       mean                 max                 min
day    Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun
time
Lunch  2.46 2.00 0.00 0.00 6.00 3.00 0.00 0.00 1.00 1.00 0.00 0.00
Dinner 2.00 2.17 2.52 2.84 2.00 4.00 5.00 6.00 2.00 2.00 1.00 2.00

In [19]:
# 각 요일별 tip_pt의 평균을 구하시오

        tip_pt
day
Thur  0.161276
Fri   0.169913
Sat   0.153152
Sun   0.166897

In [20]:
# 시간대별 tip_pt의 평균을 확인하시오

          tip_pt
time
Lunch   0.164128
Dinner  0.159518

In [26]:
# 각 요일에 따른 time별 tip_pt의 평균을 확인하시오
pd.options.display.float_format = '{:.4f}'.format

             tip_pt
day  time
Thur Lunch   0.1613
     Dinner  0.1597
Fri  Lunch   0.1888
     Dinner  0.1589
Sat  Lunch   0.0000
     Dinner  0.1532
Sun  Lunch   0.0000
     Dinner  0.1669

In [46]:
# 각 요일별로 시간대 평균인원수와 팁비율의 평균을 확인하시오

             size  tip_pt
day  time
Thur Lunch   2.46    0.16
     Dinner  2.00    0.16
Fri  Lunch   2.00    0.19
     Dinner  2.17    0.16
Sat  Dinner  2.52    0.15
Sun  Dinner  2.84    0.17

#### 연습문제 3

- 타이타닉 승객 데이터를 이용하여 다음 분석을 실시하라. 데이터는 다음과 같이 받을 수 있다.
    - titanic = sns.load_dataset("titanic")
    
- 문제 1

- qcut 명령으로 세 개의 나이 그룹을 만든다.

- 성별, 선실, 나이 그룹에 의한 생존율을 데이터프레임으로 계산한다. 
    - 행에는 성별 및 나이 그룹에 대한 다중 인덱스를 사용하고 열에는 선실 인덱스를 사용한다. 
    - 생존률은 해당 그룹의 생존 인원수를 전체 인원수로 나눈 값이다.

- 성별 및 선실에 의한 생존율을 피봇 데이터 형태로 만든다.

In [47]:
# 데이터 로드하기
titanic = sns.load_dataset("titanic")